#include <iostream>

using namespace std;
int main() {

    // 变量
    int a = 1;
    cout <<"a ="<< a<<endl;
    a = 2;
    cout << "现在 a =" << a << endl;
    return 0;

    // 标识符
    /***
     *   每个变量都有一个名字，
     *   就是所谓的“变量名”。
     *    在C++中，变量、函数、类都可以有自己专门的名字，这些名字被叫做“标识符”。
          标识符由字母、数字和下划线组成；不能以数字开头；标识符是大小写敏感的，长度不限。
          一些要求和规定
         ?不能使用C++关键字；
         ?不能用连续两个下划线开头，也不能以下划线加大写字母开头，这些被C++保留给标准库使用；
         ?函数体外的标识符，不能以下划线开头；
         ?要尽量有实际意义（不要定义a、b，而要定义name、age）；
         ?变量名一般使用小写字母；
         ?自定义类名一般以大写字母开头；
         ?如果包含多个单词，一般用下划线分隔，或者将后面的单词首字母大写；
     */


}
